{
  "sat_math_1": "Today we focused on quadratic equations. Remember, the standard form is ax² + bx + c = 0. We practiced using the quadratic formula: x = (-b ± √(b² - 4ac)) / 2a. Sarah initially had trouble identifying the coefficients a, b, and c, but after working through five examples together, she mastered it. We also covered factoring when possible - look for two numbers that multiply to ac and add to b. For homework, complete problems 1-15 on page 42, focusing on both the formula and factoring methods.",

  "sat_math_2": "We worked on geometry problems today, specifically triangles and the Pythagorean theorem. The key is recognizing when you have a right triangle: a² + b² = c², where c is the hypotenuse. Sarah struggled with word problems at first but improved once we drew diagrams for each problem. We also covered special right triangles: 30-60-90 (sides in ratio 1:√3:2) and 45-45-90 (sides in ratio 1:1:√2). Practice: complete the triangle worksheet, and always start by drawing a picture!",

  "sat_math_3": "Today's session covered linear equations and graphing. We reviewed slope-intercept form (y = mx + b) where m is the slope and b is the y-intercept. The student practiced finding slope from two points using the formula (y₂-y₁)/(x₂-x₁). We also worked on converting between standard form (Ax + By = C) and slope-intercept form. Key insight: parallel lines have the same slope, perpendicular lines have negative reciprocal slopes. Homework: graph 10 equations and identify their slopes and intercepts.",

  "ap_chem_1": "Today's lesson covered stoichiometry and mole calculations. We started with the concept that one mole equals 6.022 × 10²³ particles (Avogadro's number). Marcus understood the math but struggled with setting up dimensional analysis correctly. The key is to always write units and cancel them systematically. We worked through several problems converting between grams, moles, and particles. For the reaction 2H₂ + O₂ → 2H₂O, we calculated how many grams of water form from 4 grams of hydrogen. Practice more dimensional analysis problems from chapter 3.",

  "ap_chem_2": "We covered chemical equilibrium today, specifically Le Chatelier's Principle. When a system at equilibrium is disturbed, it shifts to counteract the change. We analyzed the Haber process: N₂ + 3H₂ ⇌ 2NH₃. Adding more N₂ shifts the equilibrium right, producing more NH₃. Increasing temperature for an exothermic reaction shifts it left. Pressure changes affect the side with more gas molecules. The student struggled with predicting shifts initially but improved after we created a flowchart for decision-making. Practice: complete the equilibrium worksheet focusing on temperature and pressure effects.",

  "college_essay_1": "We brainstormed essay topics today. Sarah has great experiences to write about: her volunteer work at the animal shelter and her robotics team project. The key is to show personal growth and reflection, not just list accomplishments. We discussed the 'show, don't tell' principle - use specific details and dialogue to bring stories to life. For next session: write a rough draft of the opening paragraph for the robotics essay, focusing on a specific moment when you faced a challenge.",

  "college_essay_2": "Today we worked on essay structure and transitions. Sarah brought her robotics draft - the opening was strong but the middle paragraphs jumped around too much. We reorganized using the 'challenge-action-result' framework: describe the problem, explain what you did, reflect on what you learned. Transitions like 'As a result' and 'This experience taught me' help guide the reader. We also cut unnecessary details that didn't support the main theme of perseverance and problem-solving. For next session: revise the entire essay and add a conclusion that connects back to why you want to study engineering.",

  "ap_physics_1": "We reviewed Newton's Laws of Motion today. First Law: objects in motion stay in motion unless acted upon by a force. Second Law: F = ma relates force, mass, and acceleration. Third Law: every action has an equal and opposite reaction. David excelled at the calculations but needed help visualizing free body diagrams. We practiced drawing FBD for objects on inclines, emphasizing that you resolve forces into components parallel and perpendicular to the surface. Homework: complete the dynamics problem set, drawing FBD for each problem first.",

  "sat_verbal_1": "Today we focused on reading comprehension strategies for the SAT. The key is to actively read: underline main ideas, circle tone words, and annotate the margins. We practiced with a passage about climate change, identifying the author's argument and supporting evidence. Isabella struggled with inference questions at first but improved when we discussed eliminating answers that were too extreme or not supported by the text. For the vocabulary-in-context questions, always plug the answer choices back into the sentence. Practice: complete 3 reading passages from the practice book, timing yourself at 13 minutes per passage."
}
